### Forest: snapshot-service-2 Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
data.external.sources_tar: Reading...
data.local_file.init: Reading...
data.local_file.init: Read complete after 0s [id=77298e3fbe90b09f523af110328b6459bffa71c6]
data.digitalocean_ssh_keys.keys: Reading...
data.digitalocean_project.forest_project: Reading...
data.external.sources_tar: Read complete after 1s [id=-]
module.monitoring[0].newrelic_alert_policy.alert: Refreshing state... [id=1349725]
module.monitoring[0].newrelic_notification_channel.slack-channel[0]: Refreshing state... [id=349ca4f8-787a-4782-9c6e-8d532f41a002]
data.local_file.sources: Reading...
data.local_file.sources: Read complete after 0s [id=3c241b935b31509a66a77870f804ed3c0161382b]
data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/8656000852680004208]
digitalocean_droplet.forest: Refreshing state... [id=417950396]
digitalocean_firewall.forest-firewall: Refreshing state... [id=4a79c6cd-e2a0-49f1-8f12-e4ee6d46dfa3]
data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.monitoring[0].newrelic_nrql_alert_condition.disk_space: Refreshing state... [id=1349725:6421439]
module.monitoring[0].newrelic_workflow.alerting-workflow-slack[0]: Refreshing state... [id=4a82f1e1-b154-4932-b97a-121adeea3ddf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2024-05-10T10:19:32Z" -> (known after apply)
      ~ disk                 = 320 -> (known after apply)
      ~ id                   = "417950396" -> (known after apply)
      ~ ipv4_address         = "144.126.220.249" -> (known after apply)
      ~ ipv4_address_private = "10.124.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "prod-forest-snapshot-2"
      ~ price_hourly         = 0.14286 -> (known after apply)
      ~ price_monthly        = 96 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
            "prod",
        ]
      ~ urn                  = "do:droplet:417950396" -> (known after apply)
      ~ user_data            = (sensitive value) # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "d8fa19e6-fef4-479e-a36a-d83fdba66322" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 417950396,
        ] -> (known after apply)
        id              = "4a79c6cd-e2a0-49f1-8f12-e4ee6d46dfa3"
        name            = "prod-forest-snapshot-2"
        tags            = []
        # (3 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:417950396",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - "144.126.220.249",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>